package Ch09;

public class C00ClassInfo {

	//객체 : 존재 사물
	//인스턴스 : 객체의 일부 정보를 추출하여(추상화) 메모리 공간에 적재해놓은 상태
	
	//에어컨
	//속성 : 로고,상품명,S/N,FAN,스탭모터,EVA
	//기능 : 제습,예약,강풍,순풍..
	
	//나무
	//속성 : 잎,가지,뿌리,꽃,열매
	//기능 : 광합성,물흡수,열매맺기
	
	//자동차
	//속성 : 핸들,바퀴,앞유리,엔진,기어
	//기능 : 가속하다,감속하다..
	
	//컴퓨터
	//속성 : CPU, RAM, DISK , S/N , 상품명 , 제조사 .. 
	//기능 : PowerOn , PowerOff, StartApp,...
	
	// 객체 지향 프로그래밍
	// 현실 객체의 정보(속성/기능) 중에 필요한 부분만 추출(추상화) 하여 프로그램에 저장하기 위해
	// 고안된 문법체계
	
	// 클래스 
	// 객체 생성을 위해서 선언된 자료형 
	// 클래스자료형을 통해서 공간을 만들고 객체에 필요한 자료가 저장된다
	
	
	//객체의 저장공간
	
	//자바의 메모리 영역
	
	// 스택영역 : 메서드(함수)내에서 생성되는 공간  일반변수(int,double..), 참조변수들.. 
	// 클래스(메서드)영역 : 공유메모리영역(생성자메서드,일반메서드,static메서드,static변수)
	// 힙영역 : 객체 저장 공간
	
	//ex)
	
	//Scanner sc = new Scanner()
	
	//Scanner 	: 클래스 자료형
	//sc 		: 참조변수
	//new 		: 힙영역에 공간 할당
	//Scanner() : 생성자 메서드(객체 생성에 필요한 초기값 저장)
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
	
}
